content/20221210100053-astrophotography.org
:PROPERTIES:
:ID:       004e9bf7-ac19-4ece-b98e-3780f4f7554e
:END:
#+title: Astrophotography
* Astrophotography
** Targets
*** Solar system
- Merkur
- Moon (Henkel)
*** Spring targets
https://www.galactic-hunter.com/post/spring-the-15-best-astrophotography-targets
- Markarian's chain
- Bode's Galaxy M81 and Cigar Galaxy M82
- Leo triplet M65, M66, NGC 3628
- North America Nebula
- Beehive cluster
- Jabbah Blue horsehead nebula (faint blue cloud)
*** Autumn targets
- Andromeda (M31)
- Triangulum (M33)

** Newtonian collimation
*** Alignment with webcam

- Use collimation cap with raspberry pi webcam

**** Setup

- Shell 1 on rpi : Take pictures in infinite loop
  #+begin_src shell
    for i in `seq 1000`;do raspistill -v -o test.jpg ;done
  #+end_src
- Shell 2 via sshfs : Prepare crosshair overlay
  #+begin_src shell
  python overlay.py 400
  #+end_src
  #+begin_src python overlay.py
    #!/usr/bin/python
    import subprocess
    import argparse

    parser = argparse.ArgumentParser(description='Process some integers.')
    parser.add_argument('radius', type=int, help='radius of circle')

    args = parser.parse_args()

    r=args.radius
    origin=(1000,1000)

    line0=[]
    line0.append((origin[0]-r,origin[1]))
    line0.append((origin[0]+r,origin[1]))

    line1=[]
    line1.append((origin[0],origin[1]-r))
    line1.append((origin[0],origin[1]+r))

    command=f"magick convert -size 2592x1944 canvas:none -fill red -draw 'line {line0[0][0]},{line0[0][1]} {line0[1][0]},{line0[1][1]}' -fill red -draw 'line {line1[0][0]},{line1[0][1]} {line1[1][0]},{line1[1][1]}'  cross.png"
    subprocess.run(command, shell=True, check=True)
  #+end_src
- Shell 3 via sshfs : Put cross.png over raw.jpg in infinite loop
  #+begin_src shell
  for i in `seq 1000`;do sleep 1s; convert raw.jpg cross.png -geometry +410-135 -composite combined.jpg;done
  #+end_src
- Shell 4 via sshfs : Display image in continously refresh mode
  #+begin_src shell
  feh --reload 0.5 combined.png
  #+end_src

**** Procedure

https://www.youtube.com/watch?v=8ROvNH5uwDo
(points out problem with secondary alignment with laser only)
1. Align secondary (colored papers opposite to eyepiece and in front of primary mirror)
   1. Make secondary mirror circular in shape in center of image (Rule out rotational error)
   2. Adjust (tilt/(rotation)) to center mark of primary in center of cross hair
2. Align primary (remove paper)
   - Get reflection of center of secondary into center of image

** Raspberry Phd guiding

https://github.com/OpenPHDGuiding/phd2/wiki/BuildingPHD2OnLinux

** Frame types
*** Light frames
*** Dark frames
- same as light frames with lens cap on
*** Flat frames
- white t-shirt method
https://photographingspace.com/how-to-create-dslr-and-ccd-flat-frames-for-astrophotography/
*** Bias frames
frames with same iso setting; fastest shutter speed; lens cap on
** HEQ5 Images through Newtonian
1. Alignment of Telescope
   - Level mount
   - align to polar star (polar finder app)
   - Make 2 or 3 star alignment
2. Focus camera
   - Find target in eyepiece (or visible star in proximity)
   - Exchange eyepiece with camera and focus (liveview or take test image)

** OTAs
| Name                         | Focal length / mm | Aperture / mm | Focal ratio / f/ |
|------------------------------+-------------------+---------------+------------------|
| Celestron Astromaster 130    |               650 |           130 |                5 |
| William Optics Zenithstar 61 |               360 |            61 |        5.9016393 |
| Nikon 55-200mm (DX)          |               200 |     33.898305 |              5.9 |
|                              |                   |               |                  |
#+TBLFM: @2$4=$2/$3::@3$4=$2/$3::@4$3=$2/$4

*** Field Flattener WO Zenithstar 61
- https://williamoptics.com/new-adjustable-flat61-for-z61
- https://www.youtube.com/watch?v=OnZUeirMpmY
- Distance between image plane and t-ring standardized to 55mm
- suggested first attempt for field flattener: 12.9mm
- adjustment:
  - trial and error at the end, you just have to slightly move back and forth a few mm and test it
    out, look on the corners for stretch stars, if the stretch goes to the center of the image it
    means the flattener is too close, if the stretch of the star are “perpendicular” to the center
    of the image, the flattener went too far, I hope this helps!
** Image Postprocessing:
https://www.youtube.com/watch?v=AKKlzbgQStE
